test_app/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Celso"], ["email", "celso@gmail.com"], ["address", "Rua Maria de Fatima"], ["created_at", "2020-05-06 21:20:17.449298"], ["updated_at", "2020-05-06 21:20:17.449298"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Mrs. Britney Corkery - Atualizado"], ["updated_at", "2020-05-09 22:54:36.774805"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)